online_results/batching_results/opt-1.3b/_32__1000/log_12071299.out
WARNING 11-21 17:56:51 _custom_ops.py:19] Failed to import from vllm._C with ModuleNotFoundError("No module named 'vllm._C'")
Namespace(backend='openai', base_url=None, host='localhost', port=40800, endpoint='/v1/completions', dataset=None, dataset_name='sharegpt', dataset_path='/gpfs/scratch/bsc98/bsc098069/llm_benchmarking/data/dummy_dataset_mean.json', model='/gpfs/scratch/bsc98/bsc098069/llm_benchmarking/models/opt/opt-1.3b', tokenizer=None, best_of=1, use_beam_search=False, num_prompts=1000, logprobs=None, request_rate=inf, seed=0, trust_remote_code=False, disable_tqdm=True, profile=False, save_result=True, metadata=None, result_dir='benchmarks/batching_results/opt-1.3b/_32__1000', result_filename=None, ignore_eos=False, percentile_metrics='ttft,tpot,itl', metric_percentiles='99', launch_server=True, server_args='--port=40800 --disable-log-requests --model=/gpfs/scratch/bsc98/bsc098069/llm_benchmarking/models/opt/opt-1.3b --max-num-seqs=32', launch_server_with_nsight=False, disable_log_stats=False, sonnet_input_len=550, sonnet_output_len=150, sonnet_prefix_len=200, sharegpt_output_len=None, random_input_len=1024, random_output_len=128, random_range_ratio=1.0, random_prefix_len=0, hf_subset=None, hf_split=None, hf_output_len=None)
Server started
Starting initial single prompt test run...
Initial test run completed. Starting main benchmark run...
Traffic request rate: inf
============ Serving Benchmark Result ============
Successful requests:                     1000      
Benchmark duration (s):                  44.82     
Total input tokens:                      242000    
Total generated tokens:                  226000    
Request throughput (req/s):              22.31     
Output token throughput (tok/s):         5042.70   
Total Token throughput (tok/s):          10442.40  
---------------Time to First Token----------------
Mean TTFT (ms):                          21647.46  
Median TTFT (ms):                        21527.76  
P99 TTFT (ms):                           42479.77  
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          6.01      
Median TPOT (ms):                        5.98      
P99 TPOT (ms):                           6.74      
---------------Inter-token Latency----------------
Mean ITL (ms):                           6.00      
Median ITL (ms):                         5.87      
P99 ITL (ms):                            7.06      
==================================================
Concurrent checker terminated
Server terminated